[
{"name": "MapSeed", "ui": "Map Seed", "default": 999, "desc": "This is the map seed used to generate the randomness of the resulting map. The remainder of the values builds off the number entered from 1 to 999. The seed used in the noise & random functions."},
{"name": "LandscapeRadius", "ui": "Landscape Radius", "default": 1.0, "desc": "The 1.0 default value leaves a ring of ocean water around the island. Increasing this number pushes the radius of land generation closer to the edges of the map while decreasing the number generates more ocean. The radius of the landscape, outside of this radius, it is water (to avoid cutting the landscape by the terrain border)."},
{"name": "Water Frequency", "ui": "Water Frequency", "default": 5.0, "desc": "This value works with the Water Level value to determine how frequently water appears on the map. Lowering the value below the default value of 5.0 reduces the frequency. The frequency of the noise function used to generate land/water."},
{"name": "Mountains Frequency", "ui": "Mountain Frequency", "default": 12.0, "desc": "How often mountains are generated across the map. The higher the value, the more mountains. The default value of 8.0 creates quite a few across the map, while a 4 will reduce the number of mountains. The frequency of the noise used to generate mountains."},
{"name": "Mountains Slope", "default": 1.8, "desc": "This works in conjunction with Mountain Height to determine how steep the mountains are. Higher Height values and lower Slope values will result in extremely steep walls. A higher slope value will give a more gradual slope. How hard the transition is from land to mountain, the higher the value the smoother the transition (from 0 to 2)", "ui": "Mountain Slope"},
{"name": "Mountain Height", "ui": "Mountain Height", "default": 1.25, "desc": "Obviously, this determines how tall mountains can get. A value of 10.0 Mountain Height will put mountains up into the cloud layer. The default value of 1.0 is close to the mountain heights found on The Island. A multiplier for mountain height."},
{"name": "Turbulence Power", "ui": "Tubulence Power", "default": 0.0125, "desc": "This number is supposed to affect how randomly the map generation follows the values entered. It’s not clear yet on how changing this number affects the variation in the map. The power of the turbulence function used to randomly perturb the coordinates input to the noise function, to add some realism to the noise"},
{"name": "Shore Slope", "default": 1.0, "desc": "This value goes from 0 to 2 and determines how hard the map transitions from the ocean floor to the shore. A higher value makes for a smoother transition. How hard the transition is from water floor to shore, the higher the value the smoother the transition (from 0 to 2)", "ui": "Shore Slope"},
{"name": "WaterLevel", "default": -0.72, "desc": "This value is essentially the sea level of the map, which can be raised or lowered based on the value entered. If you want more land, go lower than the default value of -0.72. If you want more water in the middle of your map, raise the value higher. It’s important to note that you don’t want this value to be less than the Ocean Floor Level Value. The height value for the water surface, from (Ocean Floor level to 1)", "ui": "Water Level"},
{"name": "GrassDensity", "default": 1.0, "desc": "Density of foliage in the grasslands biome", "ui": "Grasslands Grass Density"},
{"name": "JungleGrassDensity", "default": 0.02, "desc": "Foliage density in the Jungle biome", "ui": "Jungle Grass Density"},
{"name": "OceanFloorLevel", "default": -1.0, "desc": "How deep the ocean goes. The default value is -1.0 and it doesn’t need to be fiddled with much. Just make sure the number is less than the Water Level unless you want to see some really funky things happen with a map. The height value for the ocean floor (from -1 to WaterLevel)", "ui": "Ocean Flool Level"},
{"name": "Erosion Steps", "default": 4, "desc": "These are the cracks and crevices or rivulets seen alongside the sides of mountains or on the beach shores. The default value is 200,000 with a higher number giving more and a lower number giving less. Number of droplets which are used to simulate erosion", "ui": "Erosion Iterations"},
{"name": "Erosion Streangth", "ui": "Erosion Streangth", "default": 0.75, "desc": ""},
{"name": "Deposition Streangth", "ui": "Deposition Streangth", "default": 0.5, "desc": ""},
{"name": "Tree Slope Threshold", "ui": "Tree Slope Threshold", "default": 0.5, "desc": ""},
{"name": "General Mountain Trees %", "ui": "General Mountain Trees %", "default": 0.1, "desc": ""},
{"name": "TerrainScaleMultiplier", "default": 1.0, "desc": "X,Y,Z to scale the whole terrain", "ui": "Terrain Scale Multiplier"},

{"name": "SnowBiomeSize", "default": 0.3, "desc": "This is a radius value that determines how much space the Snow Biome will take up on the map. The default value of 0.3 can be thought of as 30 percent of the map starting from the “Snow Biome Location” values. Put this value at 1.0 if you want a winter wonderland. The radius of the snow biome (from 0 to 1)", "ui": "Snow Biome Size"},
{"name": "RWBiomeSize", "default": 0.075, "desc": "Just like the Snow Biome Size, this determines how much space on the map the Redwood Biome will take. The radius of the Redwood biome (from 0 to 1)", "ui": "Redwood Biome Size"},
{"name": "MountainBiomeStart", "default": -0.55, "desc": "This is a height value, not an x, y coordinate value. It determines the height at which the mountain biome starts. The height value at which the mountain biome starts", "ui": "Mountain Biome Start"},
{"name": "MountainsTreeDensity", "default": 0.01, "desc": "Density of trees and rocks in the mountain biome", "ui": "Mountain Tree Density"},
{"name": "JungleBiomeStart", "default": -0.65, "desc": "Just like the Mountain Biome Start value, this determines the height at which the Jungle biome starts. The height value at which the jungle biome start", "ui": "Jungle Biome Start"},
{"name": "IslandBorderCurveExp", "default": 4.0, "desc": "This determines how dramatically the land will curve from the shore to the ocean. A higher value than the default 4.0 can result in a Cliffs of Dover look. The exponent used in the curve to smoothly interpolate between island and water floor", "ui": "Island Border Curve"},
{"name": "MaxSawnPointHeight", "default": 0.1, "desc": "This value determines the maximum height value on land that a spawn point can be created. The maximum height of land for a spawn point to be created", "ui": "Max Sawn Point Height"},
{"name": "SnowTreeDensity", "default": 1.0, "desc": "Density of trees and rocks in the snow biome", "ui": "Snow Tree Density"},
{"name": "RedWoodTreeDensity", "default": 0.35, "desc": "Density of trees and rocks in the redwood biome", "ui": "Redwood Tree Density"},
{"name": "TreeDensity", "default": 0.003, "desc": "Density of trees and rocks in the grasslands biome", "ui": "Grasslands Tree Density"},
{"name": "RedWoodGrassDensity", "default": 0.1, "desc": "Foliage density in the Redwood biome", "ui": "Redwood Grass Density"},
{"name": "MountainGrassDensity", "default": 0.05, "desc": "Foliage density in the mountain biome", "ui": "Mountain Grass Density"},
{"name": "SnowGrassDensity", "default": 0.25, "desc": "Foliage density in the snow biome", "ui": "Snow Grass Density"},
{"name": "JungleTreeDensity", "default": 0.66, "desc": "Trees & rocks density in the jungle biome", "ui": "Jungle Tree Density"},
{"name": "ShoreTreeDensity", "default": 0.05, "desc": "Foliage density in the shore biome", "ui": "Shore Tree Density"},

{"name": "ShorelineStartOffset", "ui": "Shoreline Start Offset", "default": 0.001, "desc": "This value helps determine how wide the beaches are by marking the start point from the water line. The 0.01 default is similar to The Island, perhaps a bit less. Increase this value to generate wider beaches. Note that it does not take much of an increase. The distance from the water that the shoreline begins. Raise this for a shore that goes farther up to the land."},
{"name": "ShorelineThickness", "ui": "Shoreline Thickness", "default": 0.0015, "desc": "This value works together with the Shoreline Start Offset to determine how wide the beaches will be. Raise it above the value of 0.0015 to get more beaches. The overall width of the shore. Raise this along with ShorelineStartOffset to get a thicker, larger shore."},
{"name": "SnowMountainsTreeDensity", "default": 0.01, "desc": "Density of trees and rocks in the snow mountain biome", "ui": "Snow Mountains Tree Density"},
{"name": "UnderwaterObjectsDensity", "default": 0.5, "desc": "Object density in the underwater biome", "ui": "Underwater Objects Density"},
{"name": "SnowMountainGrassDensity", "default": 0.15, "desc": "Foliage density in the snow mountain biome", "ui": "Snow Mountain Grass Density"},
{"name": "SnowShoreTreeDensity", "default": 0.025, "desc": "Density of trees and rocks in the snow shore biome", "ui": "Snow Shore Tree Density"},
{"name": "", "ui": "Inland Water Object Density", "default": 0.5, "desc": ""},
{"name": "", "ui": "Deep Water Biomes Depth", "default": -0.24, "desc": ""},

{"name": "SnowBiomeLocation", "default": 0.2, "desc": "The location of the snow biome (X,Y from 0 to 1)", "ui": "Snow Biome Location"},
{"name": "RWForestBiomeLocation", "default": 0.5, "desc": "The location of the redwood biome (X,Y from 0 to 1)", "ui": "Redwood Biome Location"}
]